# Manipulação dados ausentes parte-2
------------

In [3]:
import pandas as pd
import numpy as np

In [7]:
df=pd.read_csv("D:/PastaUFCDs/UFCD1080803032025/Pandas/Panda520250303/travel.csv")
df

        Age          Name    No_of_pkg Package  travel_id
0     20yrs  Bikash Kumar   1 packages   $100           1
1     21yrs   Ashish Shaw   5 packages   $200           2
2   23years   Dipak Kumar        2pkgs   $100           3
3  20 Years      John Doe       3 pkgs   $100           4
4      2000        Elisha         5000   $400           5
5      5000     Md Shahid  10 packages   $200           6
6    21 yrs    Adrika Roy        7pkgs   $300           7
7    24 yrs  Shashi Kumar         2000   $500           8

### Substituir um valor específico por outro valor

       Suponha que o seu dataframe contenha alguns valores inválidos e quer substituí-los por outros valores como 0 ou NaN.
    Neste caso, os valores especiais são 5000 e 2000. Pode ver o seguinte resultado onde 2000 e 5000 são substituídos pelo valor NaN

In [8]:
import pandas as pd
import numpy as np

# Exemplo de DataFrame com valores inválidos
data = {
    'Age': [25, 30, 2000, 35, 5000],
    'No_of_pkg': [2, 5, 2000, 3, 5000],
    'travel_id': [1, 0, 1, 2, 0]
}

df = pd.DataFrame(data)

# Substituindo os valores 2000 e 5000 por NaN
df2 = df.replace({
    'Age': [2000, 5000],
    'No_of_pkg': [2000, 5000],
    'travel_id': [0]
}, np.nan)

# Exibindo o DataFrame resultante
print(df2)

    Age  No_of_pkg  travel_id
0  25.0        2.0        1.0
1  30.0        5.0        NaN
2   NaN        NaN        1.0
3  35.0        3.0        2.0
4   NaN        NaN        NaN

    Há um problema com esta abordagem é que ela substituirá todos os valores que passou na lista pelo seu valor, mas em muitos outros casos não quer como se você tiver 50.000 na coluna de preço, é válido, mas se 50000 está na coluna de nome, não é válido neste caso.
    não da coluna de preço.
    Nesse caso você precisa passar o dicionário na coluna de substituição. Este dicionário conterá o nome da coluna e o valor que você deseja substituir

In [10]:
import pandas as pd
import numpy as np

# Exemplo de DataFrame com valores inválidos
data = {
    'Age': [25, 30, 2000, 35, 5000],
    'No_of_pkg': [2, 5, 2000, 3, 5000],
    'travel_id': [1, 0, 1, 2, 0],
    'price': [10000, 50000, 20000, 50000, 30000]
}

df = pd.DataFrame(data)

# Substituindo valores inválidos específicos por NaN em cada coluna
df['Age'] = df['Age'].replace({2000: np.nan, 5000: np.nan})
df['No_of_pkg'] = df['No_of_pkg'].replace({2000: np.nan, 5000: np.nan})
df['travel_id'] = df['travel_id'].replace({0: np.nan})

# Exibindo o DataFrame resultante
print(df)

    Age  No_of_pkg  travel_id  price
0  25.0        2.0        1.0  10000
1  30.0        5.0        NaN  50000
2   NaN        NaN        1.0  20000
3  35.0        3.0        2.0  50000
4   NaN        NaN        NaN  30000

    Se quiser substituir algum valor específico como 5000 por qualquer outro valor e assim por diante.
    para passar o dicionário com todas as chaves que quer substituir e valores com os quais deseja substituir.
    Aqui 5000,2000,8 são os valores a serem substituídos são as chaves e np.NaN & 10 são os valores a serem substituídos são os valores do dicionário.

In [11]:
import pandas as pd
import numpy as np

# Exemplo de DataFrame com valores inválidos
data = {
    'Age': [25, 30, 2000, 35, 5000, 8],
    'No_of_pkg': [2, 5, 2000, 3, 5000, 8],
    'travel_id': [1, 0, 1, 2, 0, 8],
    'price': [10000, 50000, 20000, 50000, 30000, 8]
}

df = pd.DataFrame(data)

# Dicionário para substituir valores específicos
replace_dict = {
    5000: np.nan,  # Substituir 5000 por NaN
    2000: np.nan,  # Substituir 2000 por NaN
    8: 10          # Substituir 8 por 10
}

# Substituindo os valores usando o dicionário
df = df.replace(replace_dict)

# Exibindo o DataFrame resultante
print(df)

    Age  No_of_pkg  travel_id  price
0  25.0        2.0          1  10000
1  30.0        5.0          0  50000
2   NaN        NaN          1  20000
3  35.0        3.0          2  50000
4   NaN        NaN          0  30000
5  10.0       10.0         10     10

**Note:** Todos os valores no dataframe que pertencem às chaves do disccionário serão substituídos, independentemente da coluna.

### Remover caracteres desnecessários das colunas

Suponha que o seu dataframe contém caracteres desnecessários com seus valores de dados.Aqui years/yrs/Yrs/Years
    na coluna Age, o mesmo nas colunas No_of_pkg e Package são caracteres desnecessários que você não deseja
    e esses caracteres impedirão que aplique qualquer tipo de operação na análise de dados.
    para se livrar dele. Nesse caso tem que passar regex como um valor e o nome da coluna como uma chave do discionário que passou na função replace(), assim como também tem que definir regex=True e passar uma string vazia
    
* ** <code> [A-Za-z] </code> ** : This is the regex of all the character from A to Z and a to z.
* <b><code> \$ </code></b> : This is the regex for **<code>$</code>** sign.
* For futher information about regex go to this link https://medium.com/factory-mind/regex-tutorial-a-simple-cheatsheet-by-examples-649dc1c3f285

In [12]:
df3 = df2.replace({
    'Age': r'[A-Za-z]',  # Remover letras de A a Z e a a z na coluna 'Age'
    'No_of_pkg': r'[A-Za-z]',  # Remover letras de A a Z e a a z na coluna 'No_of_pkg'
    'Package': r'\$',  # Remover o símbolo de dólar '$' na coluna 'Package'
}, '', regex=True)

# Exibir o DataFrame resultante
df3

    Age  No_of_pkg  travel_id
0  25.0        2.0        1.0
1  30.0        5.0        NaN
2   NaN        NaN        1.0
3  35.0        3.0        2.0
4   NaN        NaN        NaN

### Mapeamento de uma lista para outra lista

     Se o seu conjunto de dados contém dados que se repetem mais de uma vez ou você deseja alterar algum conjunto de string para number, então você tem que aplicar mapeamento de lista.

In [13]:
mydis={
    "name":["Shahid","Adrika","Bikash","Ashish","Ganesh","Zahid","Mohan","Sohan"],
    "grades":["poor","excellent","very good","average","good","very good","outstanding","poor"]
      }
df=pd.DataFrame(mydis)
df

     name       grades
0  Shahid         poor
1  Adrika    excellent
2  Bikash    very good
3  Ashish      average
4  Ganesh         good
5   Zahid    very good
6   Mohan  outstanding
7   Sohan         poor

In [14]:
df2=df.replace(["poor","average","good","very good","excellent","outstanding"],[5,6,7,8,9,10])
df2

C:\Users\Pedro\AppData\Local\Temp\ipykernel_7472\3912370809.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df2=df.replace(["poor","average","good","very good","excellent","outstanding"],[5,6,7,8,9,10])

     name  grades
0  Shahid       5
1  Adrika       9
2  Bikash       8
3  Ashish       6
4  Ganesh       7
5   Zahid       8
6   Mohan      10
7   Sohan       5